Autodesk.Revit.Utility.AssetPropertyType
An enumerated type listing AssetProperty Types in Revit.

Autodesk.Revit.Utility.AssetPropertyType.APT_FloatArray
Represents property Float array. The corresponding AssetProperty sub class is AssetPropertyFloatArray.

Autodesk.Revit.Utility.AssetPropertyType.APT_List
Represents property List. The corresponding AssetProperty sub class is AssetPropertyList.

Autodesk.Revit.Utility.AssetPropertyType.APT_UInt64
Represents property unsigned Int64. The corresponding AssetProperty sub class is AssetPropertyUInt64.

Autodesk.Revit.Utility.AssetPropertyType.APT_Int64
Represents property Int64. The corresponding AssetProperty sub class is AssetPropertyInt64.

Autodesk.Revit.Utility.AssetPropertyType.APT_Reference
Represents property Reference. The corresponding AssetProperty sub class is AssetPropertyReference.

Autodesk.Revit.Utility.AssetPropertyType.APT_Asset
Represents property Asset. The corresponding AssetProperty sub class is Asset.

Autodesk.Revit.Utility.AssetPropertyType.APT_Distance
Represents property Distance. The corresponding AssetProperty sub class is AssetPropertyDistance.

Autodesk.Revit.Utility.AssetPropertyType.APT_Time
Represents property Time. The corresponding AssetProperty sub class is AssetPropertyTime.

Autodesk.Revit.Utility.AssetPropertyType.APT_String
Represents property String. The corresponding AssetProperty sub class is AssetPropertyString.

Autodesk.Revit.Utility.AssetPropertyType.APT_Double44
Represents property 4x4 Double matrix. The corresponding AssetProperty sub class is AssetPropertyDoubleMatrix44.

Autodesk.Revit.Utility.AssetPropertyType.APT_DoubleArray4d
Represents property 4d Double array. The corresponding AssetProperty sub class is AssetPropertyDoubleArray4d.

Autodesk.Revit.Utility.AssetPropertyType.APT_DoubleArray3d
Represents property 3d Double array. The corresponding AssetProperty sub class is AssetPropertyDoubleArray3d.

Autodesk.Revit.Utility.AssetPropertyType.APT_DoubleArray2d
Represents property 2d Double array. The corresponding AssetProperty sub class is AssetPropertyDoubleArray2d.

Autodesk.Revit.Utility.AssetPropertyType.APT_Double
Represents property Double. The corresponding AssetProperty sub class is AssetPropertyDouble.

Autodesk.Revit.Utility.AssetPropertyType.APT_Float
Represents property Float. The corresponding AssetProperty sub class is AssetPropertyFloat.

Autodesk.Revit.Utility.AssetPropertyType.APT_Integer
Represents property Integer. The corresponding AssetProperty sub class is AssetPropertyInteger.

Autodesk.Revit.Utility.AssetPropertyType.APT_Enum
Represents property Enum. The corresponding AssetProperty sub class is AssetPropertyEnum.

Autodesk.Revit.Utility.AssetPropertyType.APT_Boolean
Represents property Boolean. The corresponding AssetProperty sub class is AssetPropertyBoolean.

Autodesk.Revit.Utility.AssetPropertyType.APT_Properties
Represents Properties. The corresponding AssetProperty sub class is AssetProperties.

Autodesk.Revit.Utility.AssetPropertyType.APT_Unknown
An unknown or unspecified property type.